"use strict";

// №1 Сделайте функцию, выводящую в консоль ваше имя

function func() {
    console.log('Анька');
};
func()

// №2 Сделайте функцию, выводящую в консоль сумму чисел от 1 до 100.
function func1() {
    let sum = 0;
    for (let i = 0; i <= 100; i++) {
        sum += i;
        console.log(sum);
    }
    ;
};
func1()

// №1 Сделайте функцию, которая параметром принимает число и выводит в консоль куб этого числа.

function func2(num) {
    console.log(num ** 3);
};
func2(8)

// № 2 Сделайте функцию, которая параметром принимает число и проверяет, положительное это число или отрицательное. В первом случае пусть функция выводит в консоль текст '+++', а во втором '---'.

function func3(num) {
    if (num > 0) {
        console.log('+++');
    } else {
        console.log('---');
    }
    ;
};
func3(-8)