// № 1 В переменной month лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).


let month = 8;

if (month >= 0 && month <= 3) {
    console.log('Привет, зима!');
}
if (month >= 4 && month <= 6) {
    console.log('Привет, весна!');
}
if (month >= 7 && month <= 9) {
    console.log('Привет, лето!');
}
if (month >= 10 && month <= 12) {
    console.log('Привет, осень!');
}

// №2 ана строка, состоящая из символов, например, 'abcde'. Проверьте, что первым символом этой строки является буква 'a'. Если это так - выведите 'да', в противном случае выведите 'нет'.


let word = "sysanin";
if (word[0] == "a") {
    console.log('ДА');
} else {
    console.log('НЕТ');
}

// № 3 Дано число, например, 12345. Проверьте, что первым символом этого числа является цифра 1, 2 или 3. Если это так - выведите 'да', в противном случае выведите 'нет'.


let num = 87623;
if (String(num)[0] == 1 || String(num)[1] == 2 || String(num)[2] == 3) {
    console.log('да');
} else {
    console.log('неа')
}

// № 4 Дано трехзначное число. Найдите сумму цифр этого числа.

let num1 = String(887);

console.log(+num1[0] + +num1[1] + +num1[2]);


// № 5 Дано число из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр. Если это так - выведите 'да', в противном случае выведите 'нет'.

let num2 = String(287879);
if (+num2[0] + +num2[1] + +num2[2] == ++num2[3] + +num2[4] + +num2[5]) {
    console.log('hola, amigos!');
} else {
    console.log('agios, amigos!');
}